#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-2CLWcSoTpzdYepFx

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
module.postgres_backups_bucket.random_id.this: Refreshing state... [id=Ze9c]
module.remote_state_bucket.random_id.this: Refreshing state... [id=WvCN]
module.bucket.random_id.this: Refreshing state... [id=csAJ]
module.config_bucket.random_id.this: Refreshing state... [id=aPbH]
aws_key_pair.main: Refreshing state... [id=macbook-m2-pro]
aws_route53_zone.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0]
module.personal.aws_iam_user.this: Refreshing state... [id=alex.jackson]
module.config_bucket.aws_s3_bucket.this: Refreshing state... [id=configuration-68f6c7]
module.primary.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
module.bucket.aws_s3_bucket.this: Refreshing state... [id=uptime-72c009]
module.repositories["ticket-tracker"].aws_ecr_repository.this: Refreshing state... [id=ticket-tracker]
aws_iam_user.configuration_deployer: Refreshing state... [id=configuration.deployer]
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
aws_vpc.main: Refreshing state... [id=vpc-0d1ab7c53aec22955]
module.primary.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
module.database.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
module.database.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
module.database.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/database-policy]
module.repositories["ticket-tracker"].aws_iam_user.builder: Refreshing state... [id=ticket-tracker-builder]
aws_iam_user.postgres_backups: Refreshing state... [id=postgres.backups]
module.postgres_backups_bucket.aws_s3_bucket.this: Refreshing state... [id=postgres-backups-65ef5c]
aws_iam_user.github_actions: Refreshing state... [id=github.actions]
aws_iam_user.image_builder: Refreshing state... [id=image.builder]
module.remote_state_bucket.aws_s3_bucket.this: Refreshing state... [id=terraform-remote-state-5af08d]
module.secondary.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
module.secondary.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
data.aws_iam_policy_document.assume_role: Refreshing...
data.aws_iam_policy_document.assume_role: Refresh complete after 0s [id=2690255455]
aws_sns_topic.outages: Refreshing state... [id=arn:aws:sns:eu-west-1:558855412466:outages]
data.aws_iam_policy_document.uptime_trigger_assume_role: Refreshing...
data.aws_iam_policy_document.uptime_trigger_assume_role: Refresh complete after 0s [id=52247394]
aws_ecr_repository.uptime: Refreshing state... [id=uptime]
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
module.primary.aws_iam_role.this: Refreshing state... [id=primary-role]
module.database.aws_iam_role.this: Refreshing state... [id=database-role]
aws_iam_access_key.configuration_deployer: Refreshing state... [id=AKIAYEHTA3LZKXOXWTYC]
module.personal.aws_iam_user_policy.this: Refreshing state... [id=alex.jackson:alex.jackson.policy]
module.personal.aws_iam_user_login_profile.this: Refreshing state... [id=alex.jackson]
module.personal.aws_iam_access_key.this: Refreshing state... [id=AKIAYEHTA3LZCH5CBE4Y]
aws_iam_access_key.postgres_backups: Refreshing state... [id=AKIAYEHTA3LZFDVAEC42]
module.repositories["ticket-tracker"].aws_iam_access_key.builder: Refreshing state... [id=AKIAYEHTA3LZAHS7ZJVQ]
module.secondary.aws_iam_role.this: Refreshing state... [id=secondary-role]
aws_iam_role.uptime: Refreshing state... [id=uptime]
aws_iam_access_key.image_builder: Refreshing state... [id=AKIAYEHTA3LZI2GLLBWM]
aws_iam_role.uptime_trigger: Refreshing state... [id=uptime-trigger]
aws_iam_access_key.github_actions: Refreshing state... [id=AKIAYEHTA3LZK6JIHCYE]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]
aws_iam_user_policy.github_actions: Refreshing state... [id=github.actions:github.actions.policy]
module.primary.aws_iam_instance_profile.this: Refreshing state... [id=primary-instance-profile]
module.database.aws_iam_instance_profile.this: Refreshing state... [id=database-instance-profile]
module.database.aws_iam_role_policy_attachment.this: Refreshing state... [id=database-role-20231230120447701700000002]
module.primary.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/primary-policy]
module.repositories["ticket-tracker"].aws_iam_user_policy.builder: Refreshing state... [id=ticket-tracker-builder:ticket-tracker-builder-policy]
aws_sns_topic_subscription.outages: Refreshing state... [id=arn:aws:sns:eu-west-1:558855412466:outages:c15a0919-9e06-484e-bef6-08ab63e662d8]
aws_iam_user_policy.image_builder: Refreshing state... [id=image.builder:image.builder.policy]
aws_lambda_function.uptime: Refreshing state... [id=uptime]
module.secondary.aws_iam_instance_profile.this: Refreshing state... [id=secondary-instance-profile]
module.primary.aws_iam_role_policy_attachment.this: Refreshing state... [id=primary-role-20240406114526552400000001]
aws_iam_policy.uptime_trigger: Refreshing state... [id=arn:aws:iam::558855412466:policy/uptime-trigger]
aws_scheduler_schedule.uptime: Refreshing state... [id=default/uptime-trigger]
aws_iam_role_policy_attachment.uptime_trigger: Refreshing state... [id=uptime-trigger-20240331174144664500000001]
aws_internet_gateway.main: Refreshing state... [id=igw-0aa2c09bec52493fc]
aws_subnet.main: Refreshing state... [id=subnet-07936cc0e5c7d83b1]
aws_route_table.gateway: Refreshing state... [id=rtb-0881a403738fea9c7]
module.primary.data.aws_subnet.self: Refreshing...
module.secondary.data.aws_subnet.self: Refreshing...
module.database.aws_ebs_volume.this: Refreshing state... [id=vol-0ac43ea68879b3895]
module.database.aws_security_group.this: Refreshing state... [id=sg-0998f7db6e1ffb7eb]
module.primary.aws_security_group.this: Refreshing state... [id=sg-08183890606621a4a]
module.secondary.aws_security_group.this: Refreshing state... [id=sg-01a28996477d80518]
module.database.data.aws_subnet.self: Refreshing...
module.bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=uptime-72c009]
module.primary.data.aws_subnet.self: Refresh complete after 1s [id=subnet-07936cc0e5c7d83b1]
module.config_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=configuration-68f6c7]
aws_route_table_association.gateway: Refreshing state... [id=rtbassoc-041dbac3ebba9c5ca]
aws_iam_policy.uptime: Refreshing state... [id=arn:aws:iam::558855412466:policy/uptime-policy]
aws_iam_user_policy.configuration_deployer: Refreshing state... [id=configuration.deployer:configuration.deployer.policy]
module.secondary.data.aws_subnet.self: Refresh complete after 1s [id=subnet-07936cc0e5c7d83b1]
module.remote_state_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=terraform-remote-state-5af08d]
module.postgres_backups_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=postgres-backups-65ef5c]
aws_iam_role_policy_attachment.uptime: Refreshing state... [id=uptime-20240418192134073500000001]
aws_iam_user_policy.postgres_backups: Refreshing state... [id=postgres.backups:postgres.backups.policy]
module.database.data.aws_subnet.self: Refresh complete after 1s [id=subnet-07936cc0e5c7d83b1]
module.secondary.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-3577669816]
module.secondary.aws_security_group_rule.allow_outbound_postgres: Refreshing state... [id=sgrule-837557212]
module.secondary.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-3043586143]
module.secondary.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-1595438036]
module.secondary.aws_instance.this: Refreshing state... [id=i-09a0b082b5c40dc71]
module.secondary.aws_security_group_rule.allow_outbound_ssh: Refreshing state... [id=sgrule-3010001899]
module.primary.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-2472814117]
module.primary.aws_security_group_rule.allow_outbound_ssh: Refreshing state... [id=sgrule-2132061722]
module.primary.aws_security_group_rule.allow_outbound_subnet_postgres: Refreshing state... [id=sgrule-321011060]
module.primary.aws_security_group_rule.allow_inbound_https: Refreshing state... [id=sgrule-1830071087]
module.primary.aws_security_group_rule.allow_outbound_postgres: Refreshing state... [id=sgrule-486706373]
module.primary.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-2132790912]
module.secondary.aws_security_group_rule.allow_inbound_https: Refreshing state... [id=sgrule-1198335490]
module.secondary.aws_security_group_rule.allow_outbound_subnet_postgres: Refreshing state... [id=sgrule-2219034483]
module.primary.aws_instance.this: Refreshing state... [id=i-0532b9866a1cb8d8e]
module.primary.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-3281539395]
module.database.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-3173870365]
module.database.aws_security_group_rule.allow_inbound_postgres: Refreshing state... [id=sgrule-3465932672]
module.database.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-1983782041]
module.database.aws_instance.this: Refreshing state... [id=i-0e48bcc2a0d16252e]
module.database.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-1306823711]
aws_security_group_rule.allow_inbound_connections_from_primary: Refreshing state... [id=sgrule-3259233053]
module.secondary.aws_eip.this: Refreshing state... [id=eipalloc-04aab47b975181b3b]
module.primary.aws_eip.this: Refreshing state... [id=eipalloc-01cc4c6fab61986a3]
aws_route53_record.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0__A]
aws_route53_record.opentracker_tags: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_tags_A]
module.database.aws_volume_attachment.this: Refreshing state... [id=vai-3516952077]
module.secondary.aws_security_group.this: Drift detected (update)
module.secondary.aws_eip.this: Drift detected (update)
module.secondary.aws_iam_role.this: Drift detected (update)
module.secondary.aws_iam_instance_profile.this: Drift detected (update)
module.secondary.aws_instance.this: Drift detected (update)
module.primary.aws_iam_policy.this: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_security_group_rule.allow_inbound_connections_from_secondary will be created
  + resource "aws_security_group_rule" "allow_inbound_connections_from_secondary" {
      + description              = "Allow inbound connections from sg-01a28996477d80518"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0998f7db6e1ffb7eb"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-01a28996477d80518"
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # module.primary.aws_iam_policy.this will be updated in-place
  ~ resource "aws_iam_policy" "this" {
        id          = "arn:aws:iam::558855412466:policy/primary-policy"
        name        = "primary-policy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = [
                            "s3:GetObject",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:s3:::configuration-68f6c7/*"
                    },
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "558855412466.dkr.ecr.eu-west-1.amazonaws.com/ticket-tracker",
                        ]
                    },
                    {
                        Action   = [
                            "route53:ListHostedZones",
                            "route53:GetChange",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                    },
                    # (1 unchanged element hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags        = {}
        # (6 unchanged attributes hidden)
    }

  # module.secondary.aws_iam_policy.this will be created
  + resource "aws_iam_policy" "this" {
      + arn         = (known after apply)
      + description = "Policy for secondary-role"
      + id          = (known after apply)
      + name        = "secondary-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::configuration-68f6c7"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::configuration-68f6c7/*"
                    },
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "558855412466.dkr.ecr.eu-west-1.amazonaws.com/ticket-tracker",
                        ]
                    },
                  + {
                      + Action   = [
                          + "route53:ListHostedZones",
                          + "route53:GetChange",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "route53:ChangeResourceRecordSets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:route53:::hostedzone/Z03017682LQ8TW5YUFGE0"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.secondary.aws_iam_role_policy_attachment.this will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "secondary-role"
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>